Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, Сотрудник, Подразделение) Экспорт

	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.Сотрудник.Установить(Сотрудник);
	Набор.Отбор.Подразделение.Установить(Подразделение);
	Набор.Прочитать();

	ЧислоСекундВСутках = 900;

	Дат = НачалоДня(ДатаНачала) + 29700;
	Для к = 0 По Набор.Количество() - 1 Цикл
		Если (Дат-НачалоДня(Дат))>57600 тогда
			Дат=НачалоДня(Дат+36000)+ 29700;
			Продолжить;
		КонецЕсли;
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
			Продолжить;
		ИначеЕсли Запись.Дата = Дат Тогда
			Запись.Сотрудник =Сотрудник;
			Запись.Подразделение = Подразделение;
			Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				Запись.ЗначениеЧасов = 0;
				Запись.Значение15Мин=0;
			Иначе
				Запись.Значение15Мин=1;
				Запись.ЗначениеЧасов = 0.25;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата = Дат;
				НоваяЗапись.Сотрудник =Сотрудник;
				НоваяЗапись.Подразделение = Подразделение;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					НоваяЗапись.ЗначениеЧасов = 0;
					Запись.Значение15Мин=0;
				Иначе
					Запись.Значение15Мин=1;
					НоваяЗапись.ЗначениеЧасов = 0.25;
				КонецЕсли;
				Дат = Дат + ЧислоСекундВСутках;
			КонецЦикла;
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Запись.Сотрудник =Сотрудник;
				Запись.Подразделение = Подразделение;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.ЗначениеЧасов = 0;
					Запись.Значение15Мин=0;
				Иначе
					Запись.Значение15Мин=1;
					Запись.ЗначениеЧасов = 0.25;
				КонецЕсли;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЕсли;
	КонецЦикла;
	Набор.Записать();

	Пока Дат <= ДатаОкончания Цикл
		Если (Дат-НачалоДня(Дат))>57600 тогда
			Дат=НачалоДня(Дат+36000)+ 29700;
			Продолжить;
		КонецЕсли;
		Запись = Набор.Добавить();
		Запись.Дата = Дат;
		Запись.Подразделение = Подразделение;
		Запись.Сотрудник=Сотрудник;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.ЗначениеЧасов = 0;
			Запись.Значение15Мин=0;
		Иначе
			Запись.Значение15Мин=1;
			Запись.ЗначениеЧасов = 0.25;
		КонецЕсли;
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла;
	Набор.Записать();
КонецПроцедуры
