Процедура ОбработкаПроведения(Отказ, Режим)
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
	ЭлементБлокировки.УстановитьЗначение("Контрагент", Контрагент);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();

	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Контрагент = Контрагент;
	Движение.Проект = Проект;
	Движение.СуммаРуб = СписокНоменклатуры.Итог("Сумма");
	КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Проект.Валюта));
	Движение.СуммаВал = Движение.СуммаРуб / КурсВалюты.Курс;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.СуммаРубОстаток
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Дата, Контрагент = &Контрагент
	|	И Проект = &Проект) КАК ВзаиморасчетыОстатки";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Проект", Справочники.Проекты.ПустаяСсылка());
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();

		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Контрагент = Контрагент;
		Движение.СуммаРуб = мин(ВыборкаДетальныеЗаписи.СуммаРубОстаток, СписокНоменклатуры.Итог("Сумма"));

		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Контрагент = Контрагент;
		Движение.Проект = Проект;
		Движение.СуммаРуб = мин(ВыборкаДетальныеЗаписи.СуммаРубОстаток, СписокНоменклатуры.Итог("Сумма"));
		Движение.СуммаВал = Движение.СуммаРуб / КурсВалюты.Курс;
	КонецЕсли;
	Движения.Взаиморасчеты.Записывать = Истина;

КонецПроцедуры