Процедура ОбработкаПроведения(Отказ,Режим)
	Движения.Управленческий.БлокироватьДляИзменения = Истина;
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаСписокНоменклатуры из СписокНоменклатуры Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ПланыСчетов.Управленческий.Товары;
		Движение.СчетКт = ПланыСчетов.Управленческий.Поставщики;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ТекСтрокаСписокНоменклатуры.Номенклатура;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ИнвНомер] = ТекСтрокаСписокНоменклатуры.ИнвНомер;
		Движение.СумамаДт = ТекСтрокаСписокНоменклатуры.Сумма;
		Движение.СумамаКт = ТекСтрокаСписокНоменклатуры.Сумма;
		Движение.Количество = 1;
	КонецЦикла;
КонецПроцедуры